---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Entity.SchemaGUID
source: html/c21ebe7d-9ec1-28b2-b326-af46e11f9a1c.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Entity.SchemaGUID Property

The GUID of the Schema describing this Entity.

## Syntax (C#)
```csharp
public Guid SchemaGUID { get; }
```